#!/usr/bin/env python
# -*-coding:utf-8 -*-
# ********************************************************************************
# 文件名称：run.py
# 功能描述：报错检测分区
# 输 入 表：
# 输 出 表：
# 创 建 者：hyn
# 创建日期：20200816
# 修改日志：
# 修改日期：
# *******************************************************************************
# 程序调用格式：nohup python run.py >> nohup.out &
# *******************************************************************************


import os
import sys
import time
import check_error

# 启动
if __name__ == '__main__':

    while True:

        # 休息10分钟，600
        check_error.get_error_log()
        print 'sleep 300s'
        time.sleep(300)
