#!/usr/bin/env python
# -*-coding:utf-8 -*-
# ***************************************************************************
# 文件名称：config.py
# 功能描述：配置文件，监控大数据平台任务积压情况
# 输 入 表：
# 输 出 表：
# 创 建 者：hyn
# 创建日期：20191229
# 修改日志：
# 修改日期：
# ***************************************************************************
# 程序调用格式：python code_head.py
# ***************************************************************************

# 导入baseModule模块，然后定义子集的class，必须继承BaseObject，
# 然后定义一个函数，把业务逻辑写入函数内，在函数头上加上装饰器，则自动实现通用逻辑的调用
# 业务逻辑如果太长则可以定义多个函数，然后在主函数（就是加装饰器的函数）内按子集的业务逻辑依次调用

# 程序日志路径
log_path='/home/bdi/Asiainfo/tas/logs'



