#!/bin/bash
# ***************************************************************************
# 文件名称：copy_data_sy_to_ocdp_day.sh
# 功能描述：
# 1.苏研集群拷贝数据到ocdp集群
# 2.hdfs数据文件拷贝完成后，并加载数据到hive库，自动添加分区
# 4.注：若目标集群表分区已存在，需要先删除分区，否则加载失败
# 5.删除分区：alter table dw_ay_spots_user_yyyymmdd drop partition(day_id=20191214);
# 输 入 表：source_table_name
# 输 出 表：target_table_name
# 创 建 者：hyn
# 创建日期：20200805
# 修改日志：
# 修改日期：
# ***************************************************************************
# 程序调用格式：sh copy_data_sy_to_ocdp_day.sh copy_data_sy_to_ocdp_day 20190604
# ***************************************************************************

# 输入参数处理
table_name=$1
date=$2


