#!/usr/bin/env python
# -*-coding:utf-8 -*-
# ***************************************************************************
# 文件名称：config.py
# 功能描述：ambari监控项目配置文件
# 输 入 表：
# 输 出 表：
# 创 建 者：hyn
# 创建日期：20191010
# 修改日志：20191028
# 修改日期：
# ***************************************************************************
# 程序调用格式：python config.py
# ***************************************************************************

table_dict=[['校园模型',dw_test_yyymmddhh,'h','3','09:00'],
['234g融合',dw_test2_yyymmdd,'d','3','09:00'],
['知迹小时',dw_test3_yyymm,'m','3','09:00'],
['郑州大数据',dw_test3_yyymm,'m','3','09:00']
]