#!/usr/bin/env python
# -*-coding:utf-8 -*-
# ***************************************************************************
# 文件名称：config.py
# 功能描述：迁移Hive表
# 输 入 表：
# 输 出 表：
# 创 建 者：hyn
# 创建日期：20200810
# 修改日志：
# 修改日期：
# ***************************************************************************
# 程序调用格式：python config.py
# ***************************************************************************

partition_statis_date = 'statis_date'

# 迁移批次，0：日表，1：月表，2：年表，4：维表，全量
migration_batch = 0
int_0 = 0

# 日期格式
day_format = '%Y%m%d'

# 连接mysql
mysql_sh = "mysql -h 172.19.168.22 -P 3308 -u zhao -pzhao zhao -e ' "
excute_hive_sh = "beeline -u 'jdbc:hive2://hua-dlzx2-a0202:10000/csap' -n ocdp -p 1q2w1q@W -e '"

# 同步状态

# 未同步
copy_status_0 = '0'
# 正在同步
copy_status_1 = '1'
# 同步完成
copy_status_2 = '2'
# 同步失败
copy_status_3 = '3'

# 稽核状态
# 未稽核
chk_status_0 = ''
# 数据源
data_source = 'sy'

# 日分区表
day_length = 33

# 全量表
all_table = 'all'

# 带宽限制参数
bandwidth = '30'
map_num = '50'

#

# 日分区
day_partition = ['20200709',
                 '20200710',
                 '20200711',
                 '20200712',
                 '20200713',
                 '20200714',
                 '20200715',
                 '20200716',
                 '20200717',
                 '20200718',
                 '20200719',
                 '20200720',
                 '20200721',
                 '20200722',
                 '20200723',
                 '20200724',
                 '20200725',
                 '20200726',
                 '20200727',
                 '20200728',
                 '20200729',
                 '20200730',
                 '20200731',
                 '20200801',
                 '20200802',
                 '20200803',
                 '20200804',
                 '20200805',
                 '20200806',
                 '20200807',
                 '20200808',
                 '20200809',
                 '20200810',
                 '20200811',
                 '20200805',
                 '20200806',
                 '20200807',
                 '20200808',
                 '20200809',
                 '20200810',
                 '20200811'
                 ]
